ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/fe.xml
<?xml version="1.0" encoding="utf-8"?>
<openEspRadioPeripheralFragment id="FE">
    <peripheral>
      <name>PHY_MEMORY</name>
      <description>
        SOURCE[ROM_REV0_PHY_SET_PBUS_MEM,ROM_REV0_PHY_WRITE_PBUS_MEM,ROM_REV0_PHY_SAVE_PBUS_REG,BLOB_LIBPHY_PHY_SET_TX_CFR_MEM,ROM_REV0_PHY_WRITE_GAIN_MEM];
        CONFIDENCE[instruction-exact-partial].
        Shared PHY table-memory command, data and PBUS group-boundary aperture.
        The same command/data words have mode-dependent PBUS-memory, TX-CFR and
        gain-memory meanings; fields are named only where the complete bodies
        prove a common or mode-independent identity.
      </description>
      <baseAddress>0x20100800</baseAddress>
      <registers>
        <register>
          <name>COMMAND</name>
          <description>
            SOURCE[ROM_REV0_PHY_WRITE_PBUS_MEM,BLOB_LIBPHY_PHY_SET_TX_CFR_MEM,ROM_REV0_PHY_WRITE_GAIN_MEM];
            CONFIDENCE[instruction-exact-partial].
            Shared memory command. Bits 20:11 carry the widest evidenced PBUS
            memory command; gain-memory and TX-CFR use narrower subsets.
          </description>
          <addressOffset>0x44</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>GAIN_COMMAND_LOW_ZERO_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-semantics-unknown]. Gain-memory writes clear bits 10:0; their individual meanings are unknown.</description>
              <bitOffset>0</bitOffset><bitWidth>11</bitWidth>
              <writeConstraint><range><minimum>0</minimum><maximum>0x7ff</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MEMORY_INDEX</name>
              <description>SOURCE[ROM_REV0_PHY_WRITE_PBUS_MEM,BLOB_LIBPHY_PHY_SET_TX_CFR_MEM,ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-partial]. Low eight bits of the PBUS command and complete CFR/gain memory index.</description>
              <bitOffset>11</bitOffset><bitWidth>8</bitWidth>
              <writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint>
            </field>
            <field>
              <name>GAIN_WRITE_OR_PBUS_COMMAND_BIT_8</name>
              <description>SOURCE[ROM_REV0_PHY_WRITE_PBUS_MEM,ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-partial]. Gain-memory write selector or PBUS command bit 8.</description>
              <bitOffset>19</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PBUS_COMMAND_BIT_9</name>
              <description>SOURCE[ROM_REV0_PHY_WRITE_PBUS_MEM]; CONFIDENCE[instruction-exact]. PBUS command bit 9; CFR and gain-memory preserve it.</description>
              <bitOffset>20</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_CFR_COMMIT</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_SET_TX_CFR_MEM]; CONFIDENCE[instruction-exact]. TX-CFR entry commit pulse.</description>
              <bitOffset>21</bitOffset><bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_0</name>
          <description>SOURCE[ROM_REV0_PHY_WRITE_PBUS_MEM,BLOB_LIBPHY_PHY_SET_TX_CFR_MEM,ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-partial]. First shared table-memory data word; PBUS-memory and TX-CFR use only this word.</description>
          <addressOffset>0x48</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>OPAQUE_DATA</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xffffffff</maximum></range></writeConstraint></field></fields>
        </register>
        <register>
          <name>DATA_1</name>
          <description>SOURCE[ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-partial]. Second gain-memory data word.</description>
          <addressOffset>0x4c</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>OPAQUE_DATA</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xffffffff</maximum></range></writeConstraint></field></fields>
        </register>
        <register>
          <name>DATA_2</name>
          <description>SOURCE[ROM_REV0_PHY_WRITE_GAIN_MEM]; CONFIDENCE[instruction-exact-partial]. Third gain-memory data word.</description>
          <addressOffset>0x50</addressOffset><size>32</size><access>write-only</access>
          <fields><field><name>OPAQUE_DATA</name><bitOffset>0</bitOffset><bitWidth>32</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xffffffff</maximum></range></writeConstraint></field></fields>
        </register>
        <register>
          <dim>6</dim><dimIncrement>0x4</dimIncrement><dimIndex>0-5</dimIndex>
          <name>GROUP_BOUNDARY%s</name>
          <description>
            SOURCE[ROM_REV0_PHY_SET_PBUS_MEM,ROM_REV0_PHY_WRITE_PBUS_MEM,ROM_REV0_PHY_SAVE_PBUS_REG];
            CONFIDENCE[instruction-exact].
            Packed first/last entry indices for one even/odd PBUS-memory group
            pair. Six words describe all twelve groups.
          </description>
          <addressOffset>0x54</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>EVEN_GROUP_FIRST_ENTRY</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
            <field><name>EVEN_GROUP_LAST_ENTRY</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
            <field><name>ODD_GROUP_FIRST_ENTRY</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
            <field><name>ODD_GROUP_LAST_ENTRY</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
          </fields>
        </register>
