ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/fe.xml
        <register>
          <name>FRONT_END_INIT_0C08</name>
          <description>SOURCE[ROM_REV0_PHY_FE_REG_INIT,BLOB_LIBPHY_PHY_FE_REG_UPDATE]; CONFIDENCE[instruction-exact]. Both complete source bodies set bit 25 and then bit 26 through separate fresh-read RMW edges.</description>
          <addressOffset>0x0c08</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>INIT_FIRST_UNKNOWN</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>INIT_SECOND_UNKNOWN</name><bitOffset>26</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>IQ_CORRECTION_AUX</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,ROM_REV0_PHY_IQ_COEFFICIENTS,BLOB_LIBPHY_PHY_RXIQ_CAL_INIT]; CONFIDENCE[instruction-exact]. Shared TX-IQ coefficient and correction-mode word.</description>
          <addressOffset>0x0c0c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TX_IQ_GAIN_COEFFICIENT</name><bitOffset>0</bitOffset><bitWidth>6</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0x3f</maximum></range></writeConstraint></field>
            <field><name>TX_IQ_PHASE_COEFFICIENT</name><bitOffset>6</bitOffset><bitWidth>7</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0x7f</maximum></range></writeConstraint></field>
            <field>
              <name>TX_IQ_CORRECTION_MODE_LOW</name>
              <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,BLOB_LIBPHY_PHY_RXIQ_CAL_INIT]; CONFIDENCE[instruction-exact]. Low bit of the auxiliary correction-mode field updated through a distinct fresh-read edge by the RXIQ parent.</description>
              <bitOffset>13</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TX_IQ_CORRECTION_MODE_HIGH</name>
              <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,BLOB_LIBPHY_PHY_RXIQ_CAL_INIT]; CONFIDENCE[instruction-exact]. High bit of the auxiliary correction-mode field updated through a distinct fresh-read edge by the RXIQ parent.</description>
              <bitOffset>14</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FRONT_END_INIT_HIGH_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_FE_REG_INIT]; CONFIDENCE[instruction-exact]. Complete phy_fe_reg_init sets bit 15 after the shared correction-mode initialization.</description>
              <bitOffset>15</bitOffset><bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FRONT_END_INIT_0C20</name>
          <description>SOURCE[ROM_REV0_PHY_FE_REG_INIT]; CONFIDENCE[instruction-exact]. Final complete phy_fe_reg_init RMW replaces the low byte with 0x57.</description>
          <addressOffset>0x0c20</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>INIT_LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
          </fields>
        </register>
        <register>
          <name>I2C_TX_RATE_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact]. Complete phy_i2c_txrate_init replaces both evidenced rate fields before dispatching TX-gain compensation.</description>
          <addressOffset>0x448c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TX_RATE_LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint></field>
            <field><name>TX_RATE_HIGH_UNKNOWN</name><bitOffset>18</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
          </fields>
        </register>
        <register>
          <name>NOISE_FLOOR_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact]. Complete phy_noise_floor_auto_set sets both control bits.</description>
          <addressOffset>0x7018</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>AUTO_CONTROL_LOW_UNKNOWN</name><bitOffset>23</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>AUTO_CONTROL_HIGH_UNKNOWN</name><bitOffset>28</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>NOISE_FLOOR_MEASUREMENT</name>
          <description>SOURCE[ROM_REV0_PHY_READ_NOISE_FLOOR,HIL_OPEN_STA_RATE_CONTROL_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Complete phy_read_hw_noisefloor reads this word once, sign-extends the low twelve-bit two's-complement value and divides it arithmetically by four to produce its quarter-dB result. Higher bits are not consumed. Open rev0 HIL read a stable -92 dBm whole-unit result through the complete ROM plus wDev transform.</description>
          <addressOffset>0x708c</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field>
              <name>SIGNED_SIXTEENTH_DB_CODE</name>
              <description>SOURCE[ROM_REV0_PHY_READ_NOISE_FLOOR,HIL_OPEN_STA_RATE_CONTROL_2026_07_30]; CONFIDENCE[instruction-exact-hil-qualified]. Signed twelve-bit noise-floor measurement in sixteenth-dB units. The complete ROM arithmetic shift produces quarter-dB and wDev_GetNoiseFloor applies rounded division by four once more before retaining a signed byte; open rev0 HIL observed -92 dBm.</description>
              <bitOffset>0</bitOffset><bitWidth>12</bitWidth><access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7400</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_reg_init sets bits 14:13.</description>
          <addressOffset>0x7400</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>INIT_UNKNOWN</name><bitOffset>13</bitOffset><bitWidth>2</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint></field></fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7428</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_reg_init sets bit 14 and replaces bits 13:8 with 0x15.</description>
          <addressOffset>0x7428</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>INIT_VALUE_UNKNOWN</name><bitOffset>8</bitOffset><bitWidth>6</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0x3f</maximum></range></writeConstraint></field>
            <field><name>INIT_ENABLE_UNKNOWN</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_743C</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_reg_init clears bits 8:6 through two fresh-read updates.</description>
          <addressOffset>0x743c</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>INIT_CLEAR_UNKNOWN</name><bitOffset>6</bitOffset><bitWidth>3</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>7</maximum></range></writeConstraint></field></fields>
        </register>
        <register>
          <name>TX_OUTPUT_FILTER_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_CBW_FEATURE_WATCHDOG]; CONFIDENCE[instruction-exact]. Complete phy_bbtx_outfilter replaces bits five, six and four through three independent fresh-read RMWs.</description>
          <addressOffset>0x7440</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>FILTER_INPUT_2</name><bitOffset>4</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FILTER_INPUT_0</name><bitOffset>5</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FILTER_INPUT_1</name><bitOffset>6</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>TX_POWER_TRACK_CONTROL_0</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_BASEBAND_CONFIG]; CONFIDENCE[instruction-exact]. Complete phy_bb_txpwr_track publishes enable plus two initialization fields.</description>
          <addressOffset>0x7454</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TRACK_ENABLE</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>INIT_CLEAR_UNKNOWN</name><bitOffset>1</bitOffset><bitWidth>4</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xf</maximum></range></writeConstraint></field>
            <field><name>INIT_SET_UNKNOWN</name><bitOffset>5</bitOffset><bitWidth>5</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0x1f</maximum></range></writeConstraint></field>
          </fields>
        </register>
        <register>
          <name>TX_POWER_TRACK_CONTROL_1</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_BASEBAND_CONFIG]; CONFIDENCE[instruction-exact]. Complete phy_bb_txpwr_track clears bits 1:0 and publishes three eight-bit tracking values.</description>
          <addressOffset>0x7458</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>INIT_CLEAR_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>2</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint></field>
            <field><name>TRACK_VALUE_0_UNKNOWN</name><bitOffset>7</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
            <field><name>TRACK_VALUE_1_UNKNOWN</name><bitOffset>15</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
            <field><name>TRACK_VALUE_2_UNKNOWN</name><bitOffset>23</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
          </fields>
        </register>
        <register>
          <name>TX_POWER_TRACK_CONTROL_2</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_BASEBAND_CONFIG]; CONFIDENCE[instruction-exact]. Complete phy_bb_txpwr_track publishes four byte-wide tracking values.</description>
          <addressOffset>0x745c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TRACK_VALUE_0_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
            <field><name>TRACK_VALUE_1_UNKNOWN</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
            <field><name>TRACK_VALUE_2_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
            <field><name>TRACK_VALUE_3_UNKNOWN</name><bitOffset>24</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
          </fields>
        </register>
        <register>
          <name>TX_POWER_TRACK_CONTROL_3</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_BASEBAND_CONFIG]; CONFIDENCE[instruction-exact]. Complete phy_bb_txpwr_track publishes two byte-wide tracking values.</description>
          <addressOffset>0x7460</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>TRACK_VALUE_0_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
            <field><name>TRACK_VALUE_1_UNKNOWN</name><bitOffset>8</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
          </fields>
        </register>
        <register>
          <name>HCCFR_CONTROL</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_CFR_CONTROL]; CONFIDENCE[instruction-exact]. Complete phy_config_hccfr replaces bit 22 with the low bit of its first argument.</description>
          <addressOffset>0x7468</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_CFR_CONTROL]; CONFIDENCE[instruction-exact]. Complete phy_config_hccfr writes zero to disable HCCFR and one to enable it.</description>
              <bitOffset>22</bitOffset><bitWidth>1</bitWidth>
              <writeConstraint><useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
              <enumeratedValues>
                <name>HccfrEnable</name>
                <usage>read-write</usage>
                <enumeratedValue><name>DISABLED</name><description>Disable HCCFR processing.</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ENABLED</name><description>Enable HCCFR processing.</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HCCFR_VALUE</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_CFR_CONTROL]; CONFIDENCE[instruction-exact]. Complete phy_config_hccfr replaces the low twelve bits with its second argument.</description>
          <addressOffset>0x746c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_CFR_CONTROL]; CONFIDENCE[instruction-exact]. Complete phy_config_hccfr retains the caller value to this twelve-bit field; every representable field image is accepted by the recovered leaf.</description>
              <bitOffset>0</bitOffset><bitWidth>12</bitWidth>
              <writeConstraint><range><minimum>0</minimum><maximum>0xfff</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ICCFR_FORCE_CONTROL</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_CFR_CONTROL]; CONFIDENCE[instruction-exact]. Complete phy_force_iccfr publishes five fields through five separately ordered fresh-read RMWs.</description>
          <addressOffset>0x7478</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>FORCE_ENABLE</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_CFR_CONTROL]; CONFIDENCE[instruction-exact]. Complete phy_force_iccfr writes zero to disable the forced ICCFR value and one to enable it.</description>
              <bitOffset>0</bitOffset><bitWidth>1</bitWidth>
              <writeConstraint><useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
              <enumeratedValues>
                <name>IccfrForceEnable</name>
                <usage>read-write</usage>
                <enumeratedValue><name>DISABLED</name><description>Use the ordinary ICCFR value path.</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>ENABLED</name><description>Use the forced ICCFR value.</description><value>1</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCE_VALUE</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_CFR_CONTROL]; CONFIDENCE[instruction-exact]. Complete phy_force_iccfr retains the caller value to this twelve-bit field; every representable field image is accepted by the recovered leaf.</description>
              <bitOffset>1</bitOffset><bitWidth>12</bitWidth>
              <writeConstraint><range><minimum>0</minimum><maximum>0xfff</maximum></range></writeConstraint>
            </field>
            <field><name>FORCE_MODE_LOW</name><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FORCE_MODE_HIGH</name><bitOffset>14</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>FORCE_TRIGGER</name><bitOffset>15</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>ICCFR_ENABLE_CONTROL</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_CFR_CONTROL]; CONFIDENCE[instruction-exact]. Complete phy_iccfr_en writes three to bits 26:25 for a zero argument and clears them for a nonzero argument.</description>
          <addressOffset>0x747c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>GATE</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_CFR_CONTROL]; CONFIDENCE[instruction-exact]. Complete phy_iccfr_en writes zero for a nonzero enable input and three for a zero input; the other two encodings are not evidenced.</description>
              <bitOffset>25</bitOffset><bitWidth>2</bitWidth>
              <writeConstraint><useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
              <enumeratedValues>
                <name>IccfrGate</name>
                <usage>read-write</usage>
                <enumeratedValue><name>ENABLED</name><description>Enable ICCFR through the recovered zero gate image.</description><value>0</value></enumeratedValue>
                <enumeratedValue><name>DISABLED</name><description>Disable ICCFR through the recovered all-ones gate image.</description><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7808</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_reg_init replaces bits 13:7 with 0x60.</description>
          <addressOffset>0x7808</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>INIT_VALUE_UNKNOWN</name><bitOffset>7</bitOffset><bitWidth>7</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0x7f</maximum></range></writeConstraint></field></fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7890</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,ROM_REV0_PHY_CBW_FEATURE_WATCHDOG]; CONFIDENCE[instruction-exact]. Complete phy_bb_reg_init and phy_hemu_ru26_good_res both clear bit 25 then set bit 24 through separate fresh-read RMWs.</description>
          <addressOffset>0x7890</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>HE_RU26_GOOD_RESPONSE_ENABLE</name><bitOffset>24</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>HE_RU26_GOOD_RESPONSE_DISABLE</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_78DC</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_reg_init replaces bits 13:7 with two.</description>
          <addressOffset>0x78dc</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>INIT_VALUE_UNKNOWN</name><bitOffset>7</bitOffset><bitWidth>7</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0x7f</maximum></range></writeConstraint></field></fields>
        </register>
        <register>
          <name>BASEBAND_INIT_78E4</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_reg_init clears bit 22.</description>
          <addressOffset>0x78e4</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>INIT_CLEAR_UNKNOWN</name><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>BASEBAND_INIT_790C</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,ROM_REV0_PHY_CBW_FEATURE_WATCHDOG,ROM_REV0_PHY_CHAN_DUMP_CFG]; CONFIDENCE[instruction-exact-partial]. Complete phy_bb_reg_init clears bit 11; complete phy_lltf_mask_en independently replaces bits thirteen and twelve; complete phy_chan_dump_cfg replaces bits 7:4 and bit 11 through separate fresh-read RMWs.</description>
          <addressOffset>0x790c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>CHANNEL_DUMP_VALUE_UNKNOWN</name><description>SOURCE[ROM_REV0_PHY_CHAN_DUMP_CFG]; CONFIDENCE[instruction-exact]. Complete phy_chan_dump_cfg replaces bits 7:4 with the low nibble of its first argument.</description><bitOffset>4</bitOffset><bitWidth>4</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xf</maximum></range></writeConstraint></field>
            <field><name>INIT_CLEAR_UNKNOWN</name><bitOffset>11</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LLTF_MASK_INPUT_1</name><bitOffset>12</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>LLTF_MASK_INPUT_0</name><bitOffset>13</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7980</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_reg_init clears bit 25.</description>
          <addressOffset>0x7980</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>INIT_CLEAR_UNKNOWN</name><bitOffset>25</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7A28</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_reg_init clears bit 22.</description>
          <addressOffset>0x7a28</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>INIT_CLEAR_UNKNOWN</name><bitOffset>22</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>BASEBAND_TX_PA_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,ROM_REV0_PHY_CHAN_DUMP_CFG]; CONFIDENCE[instruction-exact-partial]. Complete phy_bb_reg_init sets bit 9; complete phy_tx_paon_set replaces bits 20:11; complete phy_chan_dump_cfg replaces bit 30 with the low bit of its second argument.</description>
          <addressOffset>0x7c00</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>BASEBAND_INIT_ENABLE_UNKNOWN</name><bitOffset>9</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>PA_ON_FIELD_UNKNOWN</name><bitOffset>11</bitOffset><bitWidth>10</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0x3ff</maximum></range></writeConstraint></field>
            <field><name>CHANNEL_DUMP_ENABLE_UNKNOWN</name><description>SOURCE[ROM_REV0_PHY_CHAN_DUMP_CFG]; CONFIDENCE[instruction-exact]. Complete phy_chan_dump_cfg replaces bit 30 with the low bit of its second argument.</description><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
