ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/fe.xml
        <register>
          <name>BASEBAND_WATCHDOG_STATUS</name>
          <description>SOURCE[ROM_REV0_PHY_CBW_FEATURE_WATCHDOG]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_wdt_get_status returns one unrestricted full-word read.</description>
          <addressOffset>0x7c08</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>BASEBAND_TX_PA_TIMING</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact-partial]. Complete phy_bb_reg_init clears bits 19:12; complete phy_tx_paon_set replaces bits 9:0 with 0x1e.</description>
          <addressOffset>0x7c30</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>PA_ON_TIMING_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>10</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0x3ff</maximum></range></writeConstraint></field>
            <field><name>BASEBAND_INIT_CLEAR_UNKNOWN</name><bitOffset>12</bitOffset><bitWidth>8</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint></field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_WATCHDOG_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact]. Complete phy_bb_wdg_cfg publishes low configuration 0x00aa and sets bit 30.</description>
          <addressOffset>0x7c3c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>WATCHDOG_CONFIG_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>16</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xffff</maximum></range></writeConstraint></field>
            <field><name>WATCHDOG_CONTROL_UNKNOWN</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>BASEBAND_WATCHDOG_ENABLE</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,ROM_REV0_PHY_CBW_FEATURE_WATCHDOG]; CONFIDENCE[instruction-exact]. Complete phy_bb_wdg_cfg sets bit 31. The standalone watchdog leaves replace bits 31 and 30 and set timeout-clear bit 29.</description>
          <addressOffset>0x7c40</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>WATCHDOG_TIMEOUT_CLEAR</name><bitOffset>29</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>WATCHDOG_INTERRUPT_ENABLE</name><bitOffset>30</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>WATCHDOG_ENABLE</name><bitOffset>31</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>NOISE_FLOOR_ENABLE_0</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact]. Complete phy_noise_floor_auto_set sets bit zero.</description>
          <addressOffset>0x7c44</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>AUTO_ENABLE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>NOISE_FLOOR_ENABLE_1</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact]. Complete phy_noise_floor_auto_set sets bit zero.</description>
          <addressOffset>0x7c50</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>AUTO_ENABLE_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>TX_PA_TABLE_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_tx_paon_set writes 0x0661a45f.</description>
          <addressOffset>0x7c6c</addressOffset><size>32</size><access>write-only</access>
        </register>
        <register>
          <name>BASEBAND_INIT_7CA8</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_bb_reg_init sets bit 20.</description>
          <addressOffset>0x7ca8</addressOffset><size>32</size><access>read-write</access>
          <fields><field><name>INIT_ENABLE_UNKNOWN</name><bitOffset>20</bitOffset><bitWidth>1</bitWidth></field></fields>
        </register>
        <register>
          <name>BASEBAND_INIT_7CD0</name>
          <description>SOURCE[ROM_REV0_PHY_REGISTER_INITIALIZATION,ROM_REV0_PHY_BTBB_WIFI_BB_CFG2]; CONFIDENCE[instruction-exact]. Complete phy_bb_reg_init sets both nibbles to 0xf; complete phy_btbb_wifi_bb_cfg2 preserves low bit two, sets the other low bits and sets the high nibble.</description>
          <addressOffset>0x7cd0</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>INIT_LOW_UNKNOWN</name><bitOffset>0</bitOffset><bitWidth>4</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xf</maximum></range></writeConstraint></field>
            <field><name>INIT_HIGH_UNKNOWN</name><bitOffset>16</bitOffset><bitWidth>4</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>0xf</maximum></range></writeConstraint></field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_IQ_ESTIMATOR_ORACLE</name>
      <description>
        SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR,BLOB_LIBPHY_PHY_CHECK_RX_SAT];
        CONFIDENCE[instruction-exact-partial].
        DC/IQ estimator configuration, signed result and activity registers
        recovered from complete S31 rev0 ROM bodies and the complete pinned
        phy_check_rx_sat blob leaf. Unknown electrical roles remain explicit.
      </description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>ESTIMATOR_CONFIG</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_iq_est_enable replaces bits 27:26 with encoding one before each measurement.</description>
          <addressOffset>0x044c</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>CONFIG_MODE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact-semantics-unknown]. Two-bit field set to encoding one by phy_iq_est_enable.</description>
              <bitOffset>26</bitOffset><bitWidth>2</bitWidth>
              <writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ESTIMATOR_CONTROL</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact-partial]. Complete phy_iq_est_enable publishes the caller control word and starts both measurement phases; complete phy_iq_est_disable clears them in reverse order around a one-microsecond delay.</description>
          <addressOffset>0x0450</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field><name>START_ENABLE</name><bitOffset>0</bitOffset><bitWidth>1</bitWidth></field>
            <field><name>MEASUREMENT_ENABLE</name><bitOffset>1</bitOffset><bitWidth>1</bitWidth></field>
            <field>
              <name>CONTROL_WINDOW_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact-semantics-unknown]. Fifteen-bit caller value shifted left by two.</description>
              <bitOffset>2</bitOffset><bitWidth>15</bitWidth>
              <writeConstraint><range><minimum>0</minimum><maximum>0x7fff</maximum></range></writeConstraint>
            </field>
            <field>
              <name>MODE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_iq_est_enable replaces the field with encoding two.</description>
              <bitOffset>19</bitOffset><bitWidth>2</bitWidth>
              <writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SIGNAL_POWER_SUM_I</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x0454</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>SIGNAL_POWER_DIFFERENCE_I</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x0458</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>SIGNAL_POWER_DIFFERENCE_Q</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x045c</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>SIGNAL_POWER_SUM_Q</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Signed result consumed by complete phy_rxiq_get_mis and phy_get_rx_sig_pwr.</description>
          <addressOffset>0x0460</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>DC_I_ACCUMULATOR</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. First signed accumulator read by complete phy_dc_iq_est.</description>
          <addressOffset>0x0464</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>DC_Q_ACCUMULATOR</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Second signed accumulator read by complete phy_dc_iq_est.</description>
          <addressOffset>0x0468</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>POWER_ACCUMULATOR</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Signed power accumulator consumed by complete phy_dc_iq_est, phy_rxiq_get_mis and phy_set_rx_gain_cal_iq.</description>
          <addressOffset>0x046c</addressOffset><size>32</size><access>read-only</access>
        </register>
        <register>
          <name>ESTIMATOR_READY_STATUS</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR]; CONFIDENCE[instruction-exact]. Complete phy_iq_est_enable tests bit 16 before leaving its readiness loop.</description>
          <addressOffset>0x047c</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field><name>READY</name><bitOffset>16</bitOffset><bitWidth>1</bitWidth></field>
          </fields>
        </register>
        <register>
          <name>ESTIMATOR_ACTIVITY_STATUS</name>
          <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR,BLOB_LIBPHY_PHY_CHECK_RX_SAT]; CONFIDENCE[instruction-exact-partial]. Complete phy_iq_est_enable counts nonzero bits 21:20 while waiting; complete phy_check_rx_sat samples the same field exactly 100 times.</description>
          <addressOffset>0x08d0</addressOffset><size>32</size><access>read-only</access>
          <fields>
            <field>
              <name>ACTIVITY_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_IQ_ESTIMATOR,BLOB_LIBPHY_PHY_CHECK_RX_SAT]; CONFIDENCE[instruction-exact-semantics-unknown]. Nonzero is treated as IQ-estimator activity and as an RX-saturation sample.</description>
              <bitOffset>20</bitOffset><bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
