ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/fe.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_RX_DCO_ORACLE</name>
      <description>
        SOURCE[BLOB_LIBPHY_PHY_XTAL_DUTY_CAL,ROM_REV0_PHY_RX_DCO_CAL];
        CONFIDENCE[instruction-exact-semantics-unknown].
        RX-DCO calibration control word recovered from complete pinned S31
        blob and rev0 ROM calibration bodies.
      </description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>CONTROL</name>
          <description>SOURCE[BLOB_LIBPHY_PHY_XTAL_DUTY_CAL,ROM_REV0_PHY_RX_DCO_CAL]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete phy_xtal_duty_cal and RX-DCO calibration bodies save, clear and restore bits 23:22 around measurement.</description>
          <addressOffset>0x0434</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>CALIBRATION_CONTROL_UNKNOWN</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_XTAL_DUTY_CAL,ROM_REV0_PHY_RX_DCO_CAL]; CONFIDENCE[instruction-exact-semantics-unknown]. Two-bit field preserved around the complete bounded RX-DCO measurement graph.</description>
              <bitOffset>22</bitOffset><bitWidth>2</bitWidth><writeConstraint><range><minimum>0</minimum><maximum>3</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_CLOCK_ORACLE</name>
      <description>
        SOURCE[ROM_REV0_PHY_OPEN_FE_BB_CLK,ROM_REV0_PHY_FE_REG_INIT,BLOB_LIBPHY_PHY_CLOSE_FE_BB_CLK];
        CONFIDENCE[instruction-exact-semantics-unknown]. OPAQUE PHY clock-gate
        registers recovered from complete no-call ROM/blob leaves.
      </description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>FE_CLOCK_GATE_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_OPEN_FE_BB_CLK,BLOB_LIBPHY_PHY_CLOSE_FE_BB_CLK]; CONFIDENCE[instruction-exact-semantics-unknown]. ROM writes 0x1e7 to open and the blob writes zero to close.</description>
          <addressOffset>0x0400</addressOffset><size>32</size><access>write-only</access>
          <fields>
            <field>
              <name>STATE</name>
              <description>SOURCE[ROM_REV0_PHY_OPEN_FE_BB_CLK,BLOB_LIBPHY_PHY_CLOSE_FE_BB_CLK]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete observed front-end clock-gate images; constituent gate meanings remain unknown.</description>
              <bitOffset>0</bitOffset><bitWidth>32</bitWidth>
              <writeConstraint><useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
              <enumeratedValues><usage>write</usage>
                <enumeratedValue><name>CLOSED</name><value>0</value></enumeratedValue>
                <enumeratedValue><name>OPEN</name><value>0x1e7</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TABLE_MEMORY_INDEX_SOURCE</name>
          <description>SOURCE[ROM_REV0_PHY_FE_REG_INIT,ROM_REV0_PHY_FORCE_PWR_INDEX,BLOB_LIBPHY_PHY_SET_TX_CFR_MEM,BLOB_LIBPHY_PHY_SET_TX_GAIN_MEM_NEW]; CONFIDENCE[instruction-exact]. Shared word contains the table-memory base index and the complete phy_force_pwr_index controls.</description>
          <addressOffset>0x0408</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>FORCED_POWER_INDEX</name>
              <description>SOURCE[ROM_REV0_PHY_FORCE_PWR_INDEX]; CONFIDENCE[instruction-exact]. Complete phy_force_pwr_index replaces bits 22:17 with the low six bits of its second argument.</description>
              <bitOffset>17</bitOffset><bitWidth>6</bitWidth>
              <writeConstraint><range><minimum>0</minimum><maximum>0x3f</maximum></range></writeConstraint>
            </field>
            <field>
              <name>FORCE_POWER_ENABLE</name>
              <description>SOURCE[ROM_REV0_PHY_FORCE_PWR_INDEX]; CONFIDENCE[instruction-exact]. Complete phy_force_pwr_index replaces bit 23 with the low bit of its first argument.</description>
              <bitOffset>23</bitOffset><bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BASE_INDEX</name>
              <description>SOURCE[ROM_REV0_PHY_FE_REG_INIT,BLOB_LIBPHY_PHY_SET_TX_CFR_MEM,BLOB_LIBPHY_PHY_SET_TX_GAIN_MEM_NEW]; CONFIDENCE[instruction-exact]. Eight-bit table-memory base index; the complete front-end initializer writes 0xa0.</description>
              <bitOffset>24</bitOffset><bitWidth>8</bitWidth>
              <writeConstraint><range><minimum>0</minimum><maximum>0xff</maximum></range></writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FE_BB_CLOCK_CONTROL_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_OPEN_FE_BB_CLK,BLOB_LIBPHY_PHY_CLOSE_FE_BB_CLK]; CONFIDENCE[instruction-exact-semantics-unknown]. ROM sets bits 1:0 and the blob clears them.</description>
          <addressOffset>0x0800</addressOffset><size>32</size><access>read-write</access>
          <fields>
            <field>
              <name>ROM_FE_BB_ENABLE_UNKNOWN</name>
              <description>SOURCE[ROM_REV0_PHY_OPEN_FE_BB_CLK,BLOB_LIBPHY_PHY_CLOSE_FE_BB_CLK]; CONFIDENCE[instruction-exact-semantics-unknown]. Two-bit open/close mask; individual meanings are unknown.</description>
              <bitOffset>0</bitOffset><bitWidth>2</bitWidth>
              <writeConstraint><useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
              <enumeratedValues><usage>write</usage>
                <enumeratedValue><name>CLOSED</name><value>0</value></enumeratedValue>
                <enumeratedValue><name>OPEN</name><value>3</value></enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHY_CALIBRATION_CLOCK_UNKNOWN</name>
              <description>SOURCE[BLOB_LIBPHY_PHY_BB_INIT]; CONFIDENCE[instruction-exact-semantics-unknown]. The phy_bb_init parent sets bit 2 before calibration; the individual hardware meaning remains unknown.</description>
              <bitOffset>2</bitOffset><bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BB_CLOCK_GATE_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_OPEN_FE_BB_CLK,BLOB_LIBPHY_PHY_CLOSE_FE_BB_CLK]; CONFIDENCE[instruction-exact-semantics-unknown]. ROM writes all ones to open and the blob writes zero to close.</description>
          <addressOffset>0x7c80</addressOffset><size>32</size><access>write-only</access>
          <fields>
            <field>
              <name>STATE</name>
              <description>SOURCE[ROM_REV0_PHY_OPEN_FE_BB_CLK,BLOB_LIBPHY_PHY_CLOSE_FE_BB_CLK]; CONFIDENCE[instruction-exact-semantics-unknown]. Complete observed baseband clock-gate images; constituent gate meanings remain unknown.</description>
              <bitOffset>0</bitOffset><bitWidth>32</bitWidth>
              <writeConstraint><useEnumeratedValues>true</useEnumeratedValues></writeConstraint>
              <enumeratedValues><usage>write</usage>
                <enumeratedValue><name>CLOSED</name><value>0</value></enumeratedValue>
                <enumeratedValue><name>OPEN</name><value>0xffffffff</value></enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
