ermacv/open-esp-radio-rs/svd/esp32s31-radio/peripherals/fe.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_FECOEX_RECOVERED</name>
      <description>SOURCE[ESP_IDF_25FE69F_S31_PHY_RETENTION,BLOB_LIBPHY_PHY_DEBUG_REG_CHECK]; CONFIDENCE[block-exact-register-semantics-opaque]. Sparse FECOEX words absent from the public platform PAC.</description>
      <baseAddress>0x20100000</baseAddress>
      <registers>
        <register>
          <name>RF_FREQUENCY_CONTROL_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Complete phy_read_rf_freq_mem performs a read-modify-write of bit 16; all other semantics remain unknown.</description>
          <addressOffset>0x20</addressOffset><size>32</size><access>read-write</access>
        </register>
        <register>
          <name>RF_FREQUENCY_RESULT_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Complete phy_read_rf_freq_mem reads this word; hardware access semantics remain unknown.</description>
          <addressOffset>0x40</addressOffset><size>32</size>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_FEDATA_RECOVERED</name>
      <description>SOURCE[ESP_IDF_25FE69F_S31_PHY_RETENTION,BLOB_LIBPHY_PHY_DEBUG_REG_CHECK]; CONFIDENCE[block-exact-register-semantics-opaque]. Sparse FEDATA words absent from the public platform PAC.</description>
      <baseAddress>0x20100400</baseAddress>
      <registers>
        <register>
          <name>RX_FILTER_MODE_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Complete phy_rx_filter_mode performs a read-modify-write; individual fields remain unnamed.</description>
          <addressOffset>0x30</addressOffset><size>32</size><access>read-write</access>
        </register>
        <register>
          <name>TX_RX_RESET_OPAQUE</name>
          <description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Complete phy_fe_txrx_reset performs a read-modify-write; individual fields remain unnamed.</description>
          <addressOffset>0x40</addressOffset><size>32</size><access>read-write</access>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_FECTRL_RECOVERED</name>
      <description>SOURCE[ESP_IDF_25FE69F_S31_PHY_RETENTION,BLOB_LIBPHY_PHY_DEBUG_REG_CHECK]; CONFIDENCE[block-exact-register-semantics-opaque]. Sparse FECTRL antenna words absent from the public platform PAC.</description>
      <baseAddress>0x20100800</baseAddress>
      <registers>
        <register><name>ANTENNA_CONFIG_WORD_0_OPAQUE</name><description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Read-modify-written by complete antenna configuration functions and saved/restored by complete phy_dig_reg_backup.</description><addressOffset>0x34</addressOffset><size>32</size><access>read-write</access></register>
        <register><name>ANTENNA_CONFIG_WORD_1_OPAQUE</name><description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Read-modify-written by complete antenna configuration functions and saved/restored by complete phy_dig_reg_backup.</description><addressOffset>0x38</addressOffset><size>32</size><access>read-write</access></register>
        <register><name>ANTENNA_CONFIG_WORD_2_OPAQUE</name><description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Read-modify-written by complete antenna configuration functions and saved/restored by complete phy_dig_reg_backup.</description><addressOffset>0x3c</addressOffset><size>32</size><access>read-write</access></register>
        <register><name>ANTENNA_CONFIG_WORD_3_OPAQUE</name><description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Read-modify-written by complete antenna configuration functions and saved/restored by complete phy_dig_reg_backup.</description><addressOffset>0x40</addressOffset><size>32</size><access>read-write</access></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_FEDATA_WIFI_RECOVERED</name>
      <description>SOURCE[ESP_IDF_25FE69F_S31_PHY_RETENTION,BLOB_LIBPHY_PHY_DEBUG_REG_CHECK]; CONFIDENCE[block-exact-register-semantics-opaque]. Sparse FEDATA_WIFI words absent from the public platform PAC.</description>
      <baseAddress>0x20100c00</baseAddress>
      <registers>
        <register><name>FREQUENCY_CORRECTION_WORD_0_OPAQUE</name><description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Complete phy_freq_correct read-modify-writes this word; individual fields remain unnamed.</description><addressOffset>0x18</addressOffset><size>32</size><access>read-write</access></register>
        <register><name>FREQUENCY_CORRECTION_WORD_1_OPAQUE</name><description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Complete phy_freq_correct read-modify-writes this word; individual fields remain unnamed.</description><addressOffset>0x1c</addressOffset><size>32</size><access>read-write</access></register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PHY_BTAGC_RECOVERED</name>
      <description>SOURCE[ESP_IDF_25FE69F_S31_PHY_RETENTION,BLOB_LIBPHY_PHY_DEBUG_REG_CHECK]; CONFIDENCE[block-exact-register-semantics-opaque]. Sparse BTAGC words absent from the public platform PAC.</description>
      <baseAddress>0x20102800</baseAddress>
      <registers>
        <register><name>RX_GAIN_FORCE_OPAQUE</name><description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Complete phy_rx_gain_force read-modify-writes this word on its Bluetooth branch.</description><addressOffset>0x40</addressOffset><size>32</size><access>read-write</access></register>
        <register><name>GAIN_OFFSET_WORD_0_OPAQUE</name><description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Complete phy_bt_gain_offset read-modify-writes this word; individual fields remain unnamed.</description><addressOffset>0x48</addressOffset><size>32</size><access>read-write</access></register>
        <register><name>GAIN_OFFSET_WORD_1_OPAQUE</name><description>SOURCE[ROM_REV0_PHY_VALIDATOR_GAPS]. Complete phy_bt_gain_offset read-modify-writes this word; individual fields remain unnamed.</description><addressOffset>0x68</addressOffset><size>32</size><access>read-write</access></register>
      </registers>
    </peripheral>
</openEspRadioPeripheralFragment>
